//  В ньому буде знаходитись логіка
//  роботи вашого express-серверу.

// в якій буде створюватись express сервер. Ця функція має в себе включати:

// Створення серверу за допомогою виклику express()
// Налаштування cors та логгера pino.
// Обробку неіснуючих роутів (повертає статус 404 і відповідне повідомлення)
// {
//   message: 'Not found',
// }

// 4. Запуск серверу на порті, вказаному через змінну оточення PORT або 3000, якщо такої змінної не зазначено

// 5. При вдалому запуску сервера виводити в консоль рядок “Server is running on port {PORT}”, де {PORT} - це номер вашого порту.

// Не забудьте вказати змінну оточення в файлі .env.example

// Створіть файл src/index.js. Імпортуйте і викличте у ньому функцію setupServer.

export const setupServer = () => {};
